Repository: sheilagomes/wp-trad
Catalog: tm/PHP_en-pt_BR.tmx
Source language: en
Languages: pt_br

source: You cannot prepend it to function or class definitions, or conditional structures such as if and foreach, and so forth.
pt_br: Você não pode prefixar definições de funções ou classe, estruturas condicionais como o if, foreach e assim por diante.

source: See also error_reporting().
pt_br: Veja também: error_reporting().

source: The "@" error-control operator prefix will not disable messages that are the result of parse errors.
pt_br: O prefixo de controle de erro "@" não desabilita mensagens que são resultado de erros de interpretação (parse errors).

source: Currently the "@" error-control operator prefix will even disable error reporting for critical errors that will terminate script execution.
pt_br: Atualmente, o operador de controle de erro "@" sempre desativa mensagens de erro, mesmo para erros críticos, que terminam a execução de scripts.

source: Among other things, this means that if you use "@" to suppress errors from a certain function and either it isn't available or has been mistyped, the script will die right there with no indication as to why.
pt_br: Além de outras coisas, isto significa que se você usar "@" para suprimir erros de certas funções e elas não estiverem disponíveis ou com tipos incorretos, o script vai parar exatamente aí sem nenhuma indicação da razão.

source: Execution Operators
pt_br: Operadores de Execução

source: PHP supports one execution operator: backticks (``).
pt_br: O PHP suporta um operador de execução: acentos graves (``).

source: Note that these are not single-quotes!
pt_br: Note que não são apóstrofes!

source: PHP will attempt to execute the contents of the backticks as a shell command; the output will be returned (i.e., it won't simply be dumped to output; it can be assigned to a variable).
pt_br: O PHP tentará executar o conteúdo dos acentos graves como um comando do shell; a saída será retornada (isto é, ela não será simplesmente descarregada para a saída; ela pode ser atribuída a uma variável).

source: The backtick operator is disabled when safe mode is enabled or shell_exec() is disabled.
pt_br: O operador de execução fica desabilitado quando o safe mode está ativo ou shell_exec() está desabilitado.

source: See also escapeshellcmd(), exec(), passthru(), popen(), shell_exec(), and system().
pt_br: Veja também: escapeshellcmd(), exec(), passthru(), popen(), shell_exec() e system().

source: Incrementing / Decrementing Operators
pt_br: Operadores de Incremento / Decremento

source: For example, in the expression 1 + 5 * 3, the answer is 16 and not 18 because the multiplication ("*") operator has a higher precedence than the addition ("+") operator.
pt_br: Precedência de Operadores

source: The following table lists the precedence of operators with the lowest-precedence operators listed first.
pt_br: Por exemplo, na expressão, 1 + 5 * 3, a resposta é 16 e não 18 porque o operador de multiplicação ("*") tem prioridade de precedência que o operador de adição ("+").

source: Operator Precedence
pt_br: A tabela seguinte mostra a precedência dos operadores, da menor precedência para a maior.

source: ! ~ + + - - (int) (float) (string) (array) (object) @
pt_br: Tabela 11-1.

source: Although! has a higher precedence than =, PHP will still allow expressions similar to the following: if (!$a = foo()), in which case the output from foo() is put into $a.
pt_br: Precedência dos operadores

source: PHP supports C-style pre - and post-increment and decrement operators.
pt_br: O PHP suporta operadores de pré e pós-incremento e decremento no estilo C.

source: Table 11-5.
pt_br: Tabela 11-5.

source: Increment / decrement Operators
pt_br: Operadores de Incremento / Decremento

source: Effect
pt_br: Efeito

source: Pre-increment
pt_br: Pré-incremento

source: Increments $a by one, then returns $a.
pt_br: Incrementa $a em um, e então retorna $a.

source: Post-increment
pt_br: Pós-incremento

source: Returns $a, then increments $a by one.
pt_br: Retorna $a, e então incrementa $a em um.

source: Pre-decrement
pt_br: Pré-decremento

source: Decrements $a by one, then returns $a.
pt_br: Decrementa $a em um, e então retorna $a.

source: Post-decrement
pt_br: Pós-decremento

source: Returns $a, then decrements $a by one.
pt_br: Retorna $a, e então decrementa $a em um.

source: Here 's a simple example script:
pt_br: Aqui está um script de exemplo simples:

source: ?php echo "h3 Postincrement / h3"; $a = 5; echo "Should be 5: ". $a+ +." br / \n"; echo "Should be 6: ". $a." br / \n"; echo "h3 Preincrement / h3"; $a = 5; echo "Should be 6: ". ++$a." br / \n"; echo "Should be 6: ". $a." br / \n"; echo "h3 Postdecrement / h3"; $a = 5; echo "Should be 5: ". $a- -." br / \n"; echo "Should be 4: ". $a." br / \n"; echo "h3 Predecrement / h3"; $a = 5; echo "Should be 4: ". --$a." br / \n"; echo "Should be 4: ". $a." br / \n";?
pt_br: ?php echo "h3 Pós-incremento / h3"; $a = 5; echo "Deve ser 5: ". $a+ +." br / \n"; echo "Deve ser 6: ". $a." br / \n"; echo "h3 Pré-incremento / h3"; $a = 5; echo "Deve ser 6: ". ++$a." br / \n"; echo "Deve ser 6: ". $a." br / \n"; echo "h3 Pós-decremento / h3"; $a = 5; echo "Deve ser 5: ". $a- -." br / \n"; echo "Deve ser 4: ". $a." br / \n"; echo "h3 Pré-decremento / h3"; $a = 5; echo "Deve ser 4: ". --$a." br / \n"; echo "Deve ser 4: ". $a." br / \n";?

source: Logical Operators
pt_br: Operadores Lógicos

source: Table 11-6.
pt_br: Tabela 11-6.

source: TRUE if both $a and $b are TRUE.
pt_br: Verdadeiro (TRUE) se tanto $a quanto $b são verdadeiros.

source: TRUE if either $a or $b is TRUE.
pt_br: Verdadeiro se $a ou $b são verdadeiros.

source: TRUE if either $a or $b is TRUE, but not both.
pt_br: Verdadeiro se $a ou $b são verdadeiros, mas não ambos.

source: TRUE if $a is not TRUE.
pt_br: Verdadeiro se $a não é verdadeiro.

source: The reason for the two different variations of "and" and "or "operators is that they operate at different precedences. (See Operator Precedence.)
pt_br: A razão para as duas variantes dos operandos "and" e "or "é que eles operam com precedências diferentes. (Veja Precedência de Operadores.)

source: There are two string operators.
pt_br: Há dois operadores de string.

source: The first is the concatenation operator ('.'), which returns the concatenation of its right and left arguments.
pt_br: O primeiro é o operador de concatenação ('.'), que retorna a concatenação dos seus argumentos direito e esquerdo.

source: The second is the concatenating assignment operator ('.='), which appends the argument on the right side to the argument on the left side.
pt_br: O segundo é o operador de atribuição de concatenação ('.='), que acrescenta o argumento do lado direito no argumento do lado esquerdo.

source: Please read Assignment Operators for more information.
pt_br: Veja em Operadores de Atribuição para mais informações.

source: $a = "Hello"; $b = $a. "World !"; / / now $b contains "Hello World! "$a = "Hello"; $a .= "World !"; / / now $a contains "Hello World! "
pt_br: $a = "Olá"; $b = $a. "mundo !"; / / agora $b contém "Olá mundo! "$a = "Olá"; $a .= "mundo !"; / / agora $a contém "Olá mundo! "

source: Array Operators
pt_br: Operadores de Arrays

source: Chapter 7.
pt_br: Capítulo 7.

source: mixed indicates that a parameter may accept multiple (but not necesseraly all) types.
pt_br: mixed

source: gettype() for example will accept all PHP types, while str_replace() will accept strings and arrays.
pt_br: mixed indica que um parâmetro pode aceitar vários (mas não necessariamente todos) os tipos

source: number indicates that a parameter can be either integer or float.
pt_br: gettype(), por exemplo, aceita todos os tipos do PHP, enquanto str_replace() somente aceita strings e arrays.

source: Some functions like call_user_function() or usort() accept user defined callback functions as a parameter.
pt_br: number indica que um parâmetro pode ser tanto um integer ou float.

source: Example 7-11.
pt_br: Exemplo 7-11.

source: Callback function examples
pt_br: Exemplo de funções callback

source: ?php / / simple callback example function foobar() {echo "hello world !";} call_user_function("foobar"); / / method callback examples class foo {function bar() {echo "hello world !";}} $foo = new foo; call_user_function(array($foo, "bar")); / / object method call call_user_function(array("foo", "bar")); / / static class method call?
pt_br: ?php / / Exemplo simples de callback function foobar() {echo "Olá mundo !";} call_user_function("foobar"); / / Exemplo de métodos callback class foo {function bar() {echo "Olá mundo !";}} $foo = new foo; call_user_function(array($foo, "bar")); / / chamada do método do objeto call_user_function(array("foo", "bar")); / / chamada do método estático da classe?

source: Type Juggling
pt_br: Manipulação de tipos

source: Chapter 15.
pt_br: Capítulo 15.

source: As said before, references aren 't pointers.
pt_br: Como dito anteriormente, referências não são ponteiros.

source: That means, the following construct won 't do what you expect:
pt_br: Isto significa que o construtor seguinte não fará o que você espera:

source: What happens is that $var in foo will be bound with $bar in caller, but then it will be re-bound with $GLOBALS[ "baz"].
pt_br: Acontece que $var na função foo estará apontada para $bar na chamada, mas ela será re-apontada para $GLOBALS[ "baz"].

source: There' s no way to bind $bar in the calling scope to something else using the reference mechanism, since $bar is not available in the function foo (it is represented by $var, but $var has only variable contents and not name-to-value binding in the calling symbol table).
pt_br: Não existe maneira de apontar $bar no escopo chamador para qualquer outra coisa utilizando o mecanismo de referências, desde que $bar não está disponível na função foo (ela é representa por $var, mas $var somente tem o conteúdo da variável e não um relacionamento nome para valor na tabela simbólica).

source: What References Do
pt_br: O as referências fazem

source: Passing by Reference
pt_br: Passagem por referência

source: References in PHP are a means to access the same variable content by different names.
pt_br: Referências

source: They are not like C pointers, they are symbol table aliases.
pt_br: Referências, em PHP, significa acessar o mesmo conteúdo de variável através de vários nomes.

source: Note that in PHP, variable name and variable content are different, so the same content can have different names.
pt_br: Note que no PHP nomes de variáveis e conteúdo de variável são tratados diferentemente, então um mesmo conteúdo pode ter nomes diferentes.

source: The most close analogy is with Unix filenames and files - variable names are directory entries, while variable contents is the file itself.
pt_br: A analogia mais próxima é a dos arquivos e seus nomes em sistemas UNIX: nomes de variáveis são o caminho completo dos arquivos, enquanto o conteúdo da variável são os dados desse arquivo.

source: References can be thought of as hardlinking in Unix filesystem.
pt_br: Assim, referências pode ser tomadas como os links físicos dentro do sistema de arquivos UNIX.

source: You can pass variable to function by reference, so that function could modify its arguments.
pt_br: Você pode passar variáveis para funções por referência, então a função poderá modificar seus argumentos.

source: The syntax is as follows:
pt_br: A sintaxe é a seguinte:

source: function foo ($var) {$var++;} $a=5; foo ($a); / / $a is 6 here
pt_br: function foo ($var) {$var++;} $a=5; foo ($a); / / $a é 6 aqui

source: Following things can be passed by reference:
pt_br: As coisas a seguir podem ser passadas por referência:

source: Variable, i.e. foo( $a)
pt_br: Exemplo: foo( $a)

source: New statement, i.e. foo( new foobar())
pt_br: Exemplo foo( new foobar())

source: Reference, returned from a function, i.e.:
pt_br: Exemplo:

source: Any other expression should not be passed by reference, as the result is undefined.
pt_br: Nenhuma outra expressão poderá ser passada por referência, com resultados indefinidos.

source: For example, the following examples of passing by reference are invalid:
pt_br: Por exemplo, o exemplo seguinte de passagem por referência é inválido:

source: function bar() / / Note the missing {$a = 5; return $a;} foo(bar()); foo($a = 5) / / Expression, not variable foo(5) / / Constant, not variable
pt_br: function bar() / / Note a falta do {$a = 5; return $a;} foo(bar()); foo($a = 5) / / Expressão, não é variável foo(5) / / Constante, não é variável

source: What References Are Not
pt_br: O que as referências não são

source: Returning References
pt_br: Retornando referências

source: Returning by-reference is useful when you want to use a function to find which variable a reference should be bound to.
pt_br: Retorno por referência é útil quando você precisa utilizar uma função para localizar variável cuja referência precisa ser obtida.

source: When returning references, use this syntax:
pt_br: Para retornar referências, utilize esta sintaxe:

source: function find_var ($param) {...code... return $found_var;} $foo = find_var ($bar); $foo - x = 2;
pt_br: function procura_var ($param) {...codigo... return $variavel_encontrada;} $foo = procura_var ($bar); $foo - x = 2;

source: Unlike parameter passing, here you have to use in both places - to indicate that you return by-reference, not a copy as usual, and to indicate that reference binding, rather than usual assignment, should be done for $foo.
pt_br: Diferentemente da passagem de parâmetros por referência, aqui você precisa utilizar em ambos os lugares -- - primeiro para indicar o retorno por referência (e não a cópia), e depois para indicar a ligação da referência (em vez da assimilação convencional) que precisa ser explícita.

source: Unsetting References
pt_br: Destruindo referências

source: Many syntax constructs in PHP are implemented via referencing mechanisms, so everything told above about reference binding also apply to these constructs.
pt_br: Vários construtores sintáticos do PHP são implementados através de mecanismos de referência, assim, tudo o explicado até aqui sobre referências também se aplica a esses construtores.

source: Some constructs, like passing and returning by-reference, are mentioned above.
pt_br: Alguns desses construtores, como a passagem e o retorno de referências foram mencionados acima.

source: Other constructs that use references are:
pt_br: Outros construtores que também utilizam referências são:

source: When you declare variable as global $var you are in fact creating reference to a global variable.
pt_br: Quando você declara uma variável com global, você está de fato criando um referência para a variável global.

source: That means, this is the same as:
pt_br: Isto significa que isto é o mesmo que:

source: That means, for example, that unsetting $var won 't unset global variable.
pt_br: $this

source: In an object method, $this is always reference to the caller object.
pt_br: Num método de objeto, $this sempre referencia o instância atual.

source: When you unset the reference, you just break the binding between variable name and variable content.
pt_br: Quando você quebra uma referência, ela apenas pára de fazer o apontamento entre o nome da variável e o conteúdo.

source: This does not mean that variable content will be destroyed.
pt_br: Mas isto não significa que o conteúdo da variável será destruído.

source: Again, it might be useful to think about this as analogous to Unix unlink call.
pt_br: Novamente, é mais fácil pensar em analogia ao comando UNIX unlink.

source: PHP references allow you to make two variables to refer to the same content.
pt_br: Referências PHP permitem fazer duas variáveis se referirem ao mesmo conteúdo.

source: Meaning, when you do:
pt_br: Ou seja:

source: The same syntax can be used with functions, that return references, and with new operator (in PHP 4.0.4 and later):
pt_br: A mesma sintaxe pode ser utilizada com funções, que retornem referências, e com o operador new (a partir do PHP 4.0.4):

source: Not using the operator causes a copy of the object to be made.
pt_br: A não utilização do operador causará a cópia do objeto.

source: If you use $this in the class it will operate on the current instance of the class.
pt_br: Se você utiliza $this em classes, ele operará na instância atual do objeto.

source: The assignment without will copy the instance (i.e. the object) and $this will operate on the copy, which is not always what is desired.
pt_br: A assimilação sem irá copiar a instância (o objeto em si) e $this irá operar na cópia, podendo não ser esse procedimento sempre desejável.

source: Usually you want to have a single instance to work with, due to performance and memory consumption issues.
pt_br: Normalmente você precisará trabalhar com uma instância única, seja por motivos de performance ou de consumo de memória.

source: While you can use the @ operator to mute any errors in the constructor when using it as @new, this does not work when using the new While you can use the @ operator to mute any errors in the constructor when using it as @new, this does not work when using the new statement.
pt_br: Você pode utilizar o operador @ para esconder quaisquer erros em construtores na forma @new, mas isto não funciona quando utilizada a instrução new.

source: This is a limitation of the Zend Engine and will therefore result in a parser error.
pt_br: Esta é uma limitação da Zend Engine e irá gerar um erro de interpretação (parser error).

source: The second thing references do is to pass variables by-reference.
pt_br: A segunda coisa que referências permitem é passar variáveis por referência.

source: This is done by making a local variable in a function and a variable in the calling scope reference to the same content.
pt_br: Isto é feito marcando uma variável local de uma função e a variável do escopo chamador como referências ao mesmo conteúdo.

source: Example:
pt_br: Exemplo:

source: The third thing reference can do is return by reference.
pt_br: Em terceiro lugar, referências permitem também retorno por referência.

source: An array in PHP is actually an ordered map.
pt_br: Arrays

source: A map is a type that maps values to keys.
pt_br: Um array no PHP é atualmente um mapa ordenado.

source: Because you can have another PHP-array as a value, you can also quite easily simulate trees.
pt_br: Este tipo é otimizado de várias maneiras, então você pode usá-lo como um array real, ou uma lista (vetor), hashtable (que é uma implementação de mapa), dicionário, coleção, pilha, fila e provavelmente mais.

source: For more information we refer you to external literature about this broad topic.
pt_br: A explicação dessas estruturas estão além do escopo desse manual, mas você pode encontrar exemplos para cada uma dessas estruturas a seguir.

source: An array can be created by the array() An array can be created by the array() language-construct.
pt_br: Para mais informações sobre estruturas, refira-se a literatura externa sobre esses tópicos.

source: It takes a certain number of comma-separated key = value pairs.
pt_br: Sintaxe

source: array( [key =] value,...) / / key is either string or nonnegative integer / / value can be anything
pt_br: Especificando com array()

source: ?php $arr = array( "foo "= "bar", 12 = true); echo $arr["foo"]; / / bar echo $arr[12]; / / 1?
pt_br: Um array pode ser criado com o construtor de linguagem array().

source: A key is either an integer or a string.
pt_br: Ele pega um certo número de pares separados por vírgula chave = valor.

source: There are no different indexed and associative array types in PHP, there is only one array type, which can both contain integer and string indices.
pt_br: Se a chave é uma representação padrão de um inteiro, ele será interpretado assim (por exemplo, "8 "será interpretado como 8, enquanto "08" será interpretado como "08 ").

source: A value can be of any PHP type.
pt_br: O valor pode ser qualquer coisa.

source: ?php $arr = array( "somearray "= array(6 = 5, 13 = 9, "a" = 42)); echo $arr["somearray"][6]; / / 5 echo $arr["somearray"][13]; / / 9 echo $arr["somearray"]["a"]; / / 42?
pt_br: Se omitir a chave, o maior índice inteiro é obtido, e a nova chave será esse máximo + 1.

source: If you omit a key, the maximum of the integer-indices is taken, and the new key will be that maximum + 1.
pt_br: Como inteiros podem ser negativos, isto também é verdadeiro para índices negativos.

source: As integers can be negative, this is also true for negative indices.
pt_br: Sendo, por exemplo, o maior índice -6, resultará em um novo índice -5.

source: Having e.g. the highest index being -6 will result in -5 being the new key.
pt_br: Se nenhum índice inteiro existir ainda, a chave será 0 (zero).

source: If you specify a key that already has a value assigned to it, that value will be overwritten.
pt_br: Se você especifica uma chave que já possui um valor assimilada a ela, então o valor é sobrescrito.

source: ?php / / This array is the same as... array( 5 = 43, 32, 56, "b "= 12); / / ...this array array(5 = 43, 6 = 32, 7 = 56, "b" = 12);?
pt_br: Utilizar true como chave será interpretado como inteiro 1 Utilizar true como chave será interpretado como inteiro 1 na chave.

source: Using TRUE as a key will evalute to integer 1 Using TRUE as a key will evalute to integer 1 as key.
pt_br: Utilizando false como chave será avaliado como o inteiro 0.

source: Using FALSE as a key will evalute to integer 0 as key.
pt_br: Usar NULL como chave é interpretado como uma string vazia.

source: Using an emptry string as key will create (or overwrite) a key with an empty string and its value, it is not the same as using empty brackets.
pt_br: Usar uma string vazia como chave irá criar (ou sobrescerver) uma chave com uma string vazia e seu valor, e isto não é o mesmo que usar colchetes vazios.

source: You cannot use arrays or objects as keys.
pt_br: Você não pode usar arrays ou objetos como chaves.

source: Doing so will result in a warning:
pt_br: Fazendo isso resultará em um alerta:

source: You can also modify an existing array, by explicitly setting values in it.
pt_br: array( [chave =] valor,...) / / chave pode ser string ou integer não negativo / / valor pode ser qualquer coisa

source: This is done by assigning values to the array while specifying the key in brackets.
pt_br: Criando / modificando com a sintaxe de colchetes

source: You can also omit the key, add an empty pair of brackets ("[]") to the variable-name in that case.
pt_br: Você pode também modificar um array existente, explicitando assimilando valores.

source: $arr[ key] = value; $arr[] = value; / / key is either string or nonnegative integer / / value can be anything
pt_br: Isto é feito apenas assimilando valores para o array enquanto especificando a chave em colchetes.

source: ?php $arr = array( 5 = 1, 12 = 2); $arr[] = 56; / / This is the same as $arr[13] = 56; / / at this point of the script $arr["x"] = 42; / / This adds a new element to / / the array with key "x "unset($arr[5]); / / This removes the element from the array unset($arr); / / This deletes the whole array?
pt_br: $arr[ chave] = valor; $arr[] = valor; / / chave tanto um string ou inteiro não negativo / / valor pode ser qualquer coisa

source: There are quite some useful function for working with arrays, see the array functions section.
pt_br: Funções úteis

source: The unset() function allows unsetting keys of an array.
pt_br: Há uma série de funções muito úteis para trabalhar com arrays, veja a seção sobre arrays.

source: Be aware that the array will NOT be reindexed.
pt_br: Nota:

source: If you only use "usual integer indices" (starting from zero, increasing by one), you can achive the reindex effect by using array_values().
pt_br: Esteja avisado que o array NÃO vai ser reindexado.
